added mermaid diagram into README.md
